#ข้อ1
""" print('รับค่าตัวเลขจากผู้ใช้ 2 จำนวน จากนั้นทำการหาผลคูณของตัวเลขที่รับเข้ามา')
a = int(input('ค่าตัวเลขที่ 1 :>>>> '))
b = int(input('ค่าตัวเลขที่ 2 :>>>> '))
sum = a * b
print ("ผลลัพธ์", a ,"*", b , "=" , sum ) """

#ข้อ2
""" print("รับบค่าตัวเลขจากผู้ใช้ 2 จำนวน จากนั้นทำการหาผลลบของตัวเลขที่รับเข้ามา")
a = int(input('ค่าตัวเลขที่ 1 :>>>> '))
b = int(input('ค่าตัวเลขที่ 2 :>>>> '))
sum = a - b
print ("ผลลัพธ์", a ,"-", b , "=" , sum ) """

#ข้อ3
# print(""" รับค่าคะเเนน เป็นเลขจำนวนเต็ม เเล้วทำการเขียนโปรเเกรมเพื่อคำนวนเกรด โดยมีเกณฑ์การการให้เกรด
#         - ถ้าคะเเนนมากกว่าหรือเท่ากับ 80 ได้เกรด A
#         - ถ้าคะเเนนอยู่ในช่วง 70 - 79 ได้เกรด B
#         - ถ้าคะเเนนอยู่ในช่วง 60 - 69 ได้เกรด C
#         - ถ้าคะเเนนอยู่ในช่วง 50 - 59 ได้เกรด D
#         - ถ้าคะเเนนต่ำกว่า 50 ได้เกรด F """)
#sore = float(input('กรอกคะเเนน:>>>>   '))
# if sore >= 101:
#     print ("???????")
# elif sore >= 80:
#     print ("เกรด A")
# elif sore >= 70:
#     print ("เกรด B")
# elif sore >= 60:
#     print ("เกรด C")
# elif sore >= 50:
#     print ("เกรด D")
# else:
#     print ("เกรด F") 

#ข้อ4
# print (""" รับค่า 1 ตัว เป็นเลขจำนวนเต็ม เเล้วตรวจสอบว่าจำนวนที่รับเข้ามา มีค่ามากกว่า 0 หรือไม่
#     ถ้ามากกว่า 0 ให้พิมพ์  มากกว่า 0 
#     ถ้าน้อยกว่าหรือเท่ากับ 0 ให้พิมพ์  น้อยกว่าหรือเท่ากับ 0  """)
# number = int(input('กรอกตัวเลข:>>>>> '))
# if number > 0:
#     print (" มากกว่า 0 ")
# else:
#     print (" น้อยกว่าหรือเท่ากับ 0 ")

#ข้อ 5 
# print (""" รับค่า 1 ตัว เป็นเลขจำนวนเต็ม เเล้วตรวจสอบว่าจำนวนที่รับเข้ามามีค่ามากกว่า 0 น้อยกว่า 0 หรือเท่ากับ 0 
#         -  ถ้ามากกว่า 0 ให้พิมพ์ " positive "   
#         -  ถ้าน้อยกว่า 0 ให้พิมพ์ " negative "   
#         -  ถ้าเท่ากับ 0 ให้พิมพ์ " zero "  """)
# number = int(input('กรอกตัวเลข:>>>>> '))
# if number == 0:
#     print (" zero ")
# elif number < 0:
#     print (" negative ")
# else:
#     print (" positive ")

#ข้อ6
# print (""" รับค่า 2 เป็นเลขจำนวนเต็ม (width , length) เเล้วตรวจสอบว่า ถ้าค่าที่รับเข้ามีค่าติดลย ให้พิมพ์  
#         " กรุณากรอกจำนวนเต็ม " เเต่ถ้าเป็นจำนวน้ต็มบวกทั้งคู่ ให้คำนวณพื้นที่สีเหลี่ยมเเละพิมพ์ออกมา """)
# length = int(input(' กรอกค่า length :>>>>>   '))
# width = int(input(' กรอกค่า width :>>>>>   '))
# if length < 0 or width < 0 :
#     print (" กรุณากรอกจำนวนเต็ม ")
# else:
#     sum = length * width
#     print ("ค่าพื้นที่สีเหลี่ยม" , "=" , sum)

#ข้อ 7 
# print ("""รับค่า 1 ตัว เป็นจำนวนเงินในหน่วยดอลลาร์สหรัฐ เเล้วตรวจสอบว่า จำนวนที่รับเข้ามามีค่ามากกว่า 0 หรือไม่
#         - ถ้ามากกว่า 0 ให้คำนวณเงินในหน่วยบาท ( THB = USD * 32.5  ) 
#         - ถ้าน้อยกว่าหีือเท่ากับ 0 ให้พิมพ์ " You don't have money "   """)
# USD = float(input('กรอกจำนวนเงิน:>>>>')) 
# print ("รับเงินมา" , USD , "ดอลลาร์สหรัฐ")
# if USD <= 0:
#     print ("You don't have money")
# else:
#     THB = USD * 32.5
#     print ("แปลงเป็นเงิน", THB , "บาท")

#ข้อ 8
# print (""" รับตัวเลข 3 จำนวน เเล้วตรวจสอบว่า ผลบวกของจำนวนที่หนึ่งเเละจำนวนที่สองมากกว่าจำนวนที่สามหรือไม่
#         - ถ้ามากกว่าให้พิมพ์ " a + b > c  "  
#         - ถ้าน้อยกว่าหรือเท่ากับ ไม่ต้องดำเนินการใดๆ """)
# a = int(input('กรอกจำนวนที่ 1 :>>>> '))
# b = int(input('กรอกจำนวนที่ 2 :>>>>'))
# c = int(input('กรอกจำนวนที่ 3 :>>>>'))
# sum = a + b
# if sum > c:
#     print ("  a + b > c ")
# else:
#     print ("  ")

#ข้อ 9
# print (""" รับอินพุต 2 ตัว เป็นเลขจำนวนเต็ม(hour , minute) เพื่อคำนวณค่าจอดรถ
#         - โดยชั่วโมงเเรกจอดฟรี หลังจากนั้นเสียค่าจอดชั่วโมงละ 30 บาท
#         - เศษของชั่วโมงนับเป็น 1 ชั่วโมง
#         - จากนั้นพิมพ์ค่าจอดรถออกมา
#         - เเต่ถ้าผู้ใช้ป้อนอินพุตตัวใดตัวหนึ่ง เป็นตัวเลขติดลบ ให้พิมพ์ "โปรดใส่ข้อมูลที่ไม่ติดลบ" เเละไม่ต้องคำนวณค่าจอดรถ """)
# hour = int(input("ชั่วโมงที่ใช้จอด:>>>>"))
# minute = float(input("ชั่วโมงที่ใช้จอด:>>>>"))
# if hour and minute < 0:
#     print ("โปรดใส่ข้อมูลที่ไม่ติดลบ")
# elif minute > 0:
#     hurs = hour + 1
#     pay = hurs * 30
#     print ( "ค่าจอดรถ" , pay , "บาท")

""" print (" พิมพ์เลขจำนวนเต็มตั้งเเต่ 0 จนถึง 20 ออกมาทางหน้าจอ ")
i = 0
while i <= 20:
    print (i)
    i += 1 """

""" print("  พิมพ์เลขจำนวนเต็มตั้งเเต่ 0,2,4.....18  ออกมาทางหน้าจอ ")
i = 0
while i <= 18:
    print(i)
    i += 2  """

""" print("  พิมพ์เลขจำนวนเต็มตั้งเเต่ 19,18,17....0  ออกมาทางหน้าจอ ")
i = 19
while i >= 0:
    print (i)
    i -= 1 """
 
"""print("  พิมพ์เลขจำนวนเต็มตั้งเเต่ -5,-7,-9,...-15  ออกมาทางหน้าจ ")
i = -5
while i >= -15: #จะทำงานในขณะที่ค่าในตัวแปร i ยังคงน้อยกว่าหรือเท่ากับ 10 
    print (i)
    i -= 2 """

""" print(" หาผลรวมตั้ง 1 ถึง 10 ")
i = 1 
sum = 0
while i <= 10:
   sum = sum + i
   print (sum)
   i += 1 """

""" print(" หาผลคูณตั้ง 1 ถึง 10 ")
i = 1 
sum = 1
while i <= 10:
   sum = sum + i
   print (sum)
   i += 1  """